
let title = document.querySelectorAll(".listItems .item .itemSVG");
let imgSVG = document.querySelectorAll(".listItems .item .itemTitle");
let desc = document.querySelectorAll(".listItems .item .itemText");
let listi = document.querySelectorAll(".section-advantages .item");
console.log(listi);

var listItems = [
  {
    id: 1,
    svgIcon:
      '<svg id="iconMoney" viewBox="0 0 24 16.92" xmlns="http://www.w3.org/2000/svg" width="50" height="50"><path d="M12,2.5a4,4,0,1,0,4,4A4,4,0,0,0,12,2.5Zm0,7a3,3,0,1,1,3-3A3,3,0,0,1,12,9.5Z"/><path d="M23.5,0H.5A.5.5,0,0,0,0,.5V16.42a.5.5,0,0,0,.5.5h23a.5.5,0,0,0,.5-.5V.5A.5.5,0,0,0,23.5,0ZM23,12H20.1A3.45,3.45,0,0,1,23,9.1Zm-3.89,0H4.89A4.41,4.41,0,0,0,1,8.11V4.89A4.41,4.41,0,0,0,4.89,1H19.11A4.41,4.41,0,0,0,23,4.89V8.11A4.41,4.41,0,0,0,19.11,12ZM3.9,12H1V9.1A3.45,3.45,0,0,1,3.9,12ZM1,13H23v1H1ZM23,1V3.9A3.45,3.45,0,0,1,20.1,1ZM1,1H3.9A3.45,3.45,0,0,1,1,3.9ZM23,15.92H1V15H23Z"/></svg>',
    title: "Меньшая стоимость оплаты",
    desc:
      "Например, новую профессию можно получить за сравнительно недорогую оплату",
  },
  {
    id: 2,
    svgIcon:
      '<svg id="iconCity" version="1.0" viewBox="0 0 64 64" xmlns="http://www.w3.org/2000/svg"  width="50" height="50"><path d="M22,47h4a1,1,0,0,0,1-1V42a1,1,0,0,0-1-1H22a1,1,0,0,0-1,1v4A1,1,0,0,0,22,47Zm1-4h2v2H23Z"/><path d="M30,47h4a1,1,0,0,0,1-1V42a1,1,0,0,0-1-1H30a1,1,0,0,0-1,1v4A1,1,0,0,0,30,47Zm1-4h2v2H31Z"/><path d="M22,55h4a1,1,0,0,0,1-1V50a1,1,0,0,0-1-1H22a1,1,0,0,0-1,1v4A1,1,0,0,0,22,55Zm1-4h2v2H23Z"/><path d="M30,55h4a1,1,0,0,0,1-1V50a1,1,0,0,0-1-1H30a1,1,0,0,0-1,1v4A1,1,0,0,0,30,55Zm1-4h2v2H31Z"/><polygon points="49.71 13.71 51.41 12 53 12 53 13.59 51.29 15.29 52.71 16.71 54 15.41 55.29 16.71 56.71 15.29 55 13.59 55 12 56.59 12 58.29 13.71 59.71 12.29 58.41 11 59.71 9.71 58.29 8.29 56.59 10 55 10 55 8.41 56.71 6.71 55.29 5.29 54 6.59 52.71 5.29 51.29 6.71 53 8.41 53 10 51.41 10 49.71 8.29 48.29 9.71 49.59 11 48.29 12.29 49.71 13.71"/><path d="M57,24a3,3,0,1,0,3-3A3,3,0,0,0,57,24Zm3-1a1,1,0,1,1-1,1A1,1,0,0,1,60,23Z"/><path d="M38,15a3,3,0,1,0-3-3A3,3,0,0,0,38,15Zm0-4a1,1,0,1,1-1,1A1,1,0,0,1,38,11Z"/><path d="M16,7a3,3,0,1,0-3-3A3,3,0,0,0,16,7Zm0-4a1,1,0,1,1-1,1A1,1,0,0,1,16,3Z"/><path d="M61,54a1,1,0,0,0-.29-.71l-6-6a1,1,0,0,0-1.42,0L51,49.59l-2.29-2.3a1,1,0,0,0-1.42,0l-6,6A1,1,0,0,0,41,54v7H39V41H62a1,1,0,0,0,.92-.62,1,1,0,0,0-.21-1.09L44.18,20.77a9.44,9.44,0,0,0-13.36,0L29,22.59V12a1,1,0,0,0-1-1H4a1,1,0,0,0-1,1V61H1v2H63V61H61Zm-7-4.59,5,5V61H55V54a1,1,0,0,0-.29-.71L52.41,51Zm-11,5,5-5,5,5V61H43ZM20,23v8H12V23Zm-8-2V13h8v8ZM37,57H19V39H37ZM18,37a1,1,0,0,0-1,1v3H12V33h8v4Zm4,0V33h5v4Zm0-6V23h5v8ZM10,31H5V23h5Zm0,2v8H5V33Zm0,10v8H5V43Zm2,0h5v8H12Zm7,16H37v2H19ZM39,39V38a1,1,0,0,0-1-1H29V34h1a4,4,0,0,0,4-4,1,1,0,0,1,2,0v1a3,3,0,0,0,6,0V28a1,1,0,0,1,2,0,3,3,0,0,0,3,3h4.59l8,8ZM32.23,22.18a7.46,7.46,0,0,1,10.54,0L49.59,29H47a1,1,0,0,1-1-1,3,3,0,0,0-6,0v3a1,1,0,0,1-2,0V30a3,3,0,0,0-6,0,2,2,0,0,1-2,2H29V25.41ZM27,21H22V13h5ZM10,13v8H5V13ZM5,53H17v8H5Z"/><path d="M50,54H46a1,1,0,0,0-1,1v4a1,1,0,0,0,1,1h4a1,1,0,0,0,1-1V55A1,1,0,0,0,50,54Zm-1,4H47V56h2Z"/></svg>',
    title: "Можно учиться, где угодно и как угодно",
    desc: "",
  },
  {
    id: 3,
    svgIcon:
      '<svg version="1.1" id="iconSpeedMeter" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" viewBox="0 0 28 28"  width="50" height="50"><path d="M15.391,19.341L14,11l-1.39,8.341C11.653,19.842,11,20.845,11,22c0,1.657,1.343,3,3,3s3-1.343,3-3	C17,20.845,16.348,19.842,15.391,19.341z"/><path d="M14,3C6.268,3,0,9.268,0,17c0,2.059,0.444,4.014,1.242,5.773c0.544-0.312,1.147-0.605,1.8-0.875 C2.372,20.402,2,18.745,2,17C2,10.373,7.373,5,14,5s12,5.373,12,12c0,1.745-0.372,3.402-1.042,4.898 c0.653,0.27,1.256,0.562,1.8,0.875C27.557,21.014,28,19.059,28,17C28,9.268,21.732,3,14,3z"/><path d="M3.828,21.377l-0.617-1.901l3.805-1.235l0.617,1.902L3.828,21.377z M9.063,11.929l-2.35-3.236 l1.62-1.176l2.35,3.237L9.063,11.929z M13,6h2v4h-2V6z M7.015,15.801l-3.804-1.236l0.619-1.902l3.804,1.236L7.015,15.801z M20.983,15.8l-0.617-1.902l3.806-1.235l0.617,1.901L20.983,15.8z M17.316,10.753l2.352-3.235l1.619,1.176l-2.351,3.236 L17.316,10.753z M24.172,21.377l-3.805-1.235l0.617-1.901l3.805,1.235L24.172,21.377z"/></svg>',
    title: "Индивидуальный темп обучения",
    desc:
      "Вы можете много раз пересматривать видео лекций или презентаций если вам что-то стало не понятно, при этом не отвлекая остальную группу",
  },
  {
    id: 4,
    svgIcon:
      '<svg version="1.1" id="iconClock" xmlns="http://www.w3.org/2000/svg" width="510px" height="510px" viewBox="0 0 510 510"  width="50" height="50" > <path style="opacity:0.9;enable-background:new    ;" d="M267.75,12.75c-89.25,0-168.3,48.45-209.1,122.4L0,76.5v165.75h165.75 l-71.4-71.4c33.15-63.75,96.9-107.1,173.4-107.1C372.3,63.75,459,150.45,459,255s-86.7,191.25-191.25,191.25 c-84.15,0-153-53.55-181.05-127.5H33.15c28.05,102,122.4,178.5,234.6,178.5C402.9,497.25,510,387.6,510,255 C510,122.4,400.35,12.75,267.75,12.75z M229.5,140.25V270.3l119.85,71.4l20.4-33.15l-102-61.2v-107.1H229.5z"/></svg>',
    title: "Удобное время обучения для вас",
    desc: "Вам не нужно будет подстраиваться под группу или преподавателя",
  },
  {
    id: 5,
    svgIcon:
      '<svg id="iconReact" version="1.1" xmlns="http://www.w3.org/2000/svg" width="50px" height="50px"><path d="M194.2049408,329.2963867c-22.9812927,41.3840332,4.4992981,73.3360596,54.4763031,92.453064v28.0691528h-52.7408905l-17.4946594-60.7532043c-12.1775208-3.1057129-24.2567596-7.7472229-36.0391388-14.0788269l-59.414299,34.7086487l-35.3576431-35.357666l32.1224213-60.0131531c-6.2860947-11.0388184-11.1512985-22.7106934-14.5720749-34.7373047L0,261.8805847v-50.0900574l64.8365021-19.0444489c3.3286743-12.0869446,8.0897293-23.8344269,14.300827-34.9477081L46.1614037,98.8424835L81.519043,63.4847832l59.428299,33.3822594c11.3363647-6.2393951,22.963501-10.9169006,34.6914215-14.1426392l18.3372803-66.8742294h50.0899811l18.869278,68.2760468c11.0263062,3.375,21.6495056,7.926712,31.6786804,13.5394363l62.4001465-35.6540833l35.3576355,35.3576431l-35.4750366,62.9934387c9.1016235,16.729126,15.2998352,35.4611206,17.7366333,55.7192688l-62.5748291,0.000061c-12.5958557-62.3779449-84.6269531-97.8009949-143.0301819-64.1308594C89.4339676,197.7855988,116.6350937,315.5329285,194.2049408,329.2963867z M342.9030151,381.1938477c-18.0298767-10.4632568-18.0298767-36.7634888,0-47.2267761c18.0298767-10.4632568,40.6896057,2.6868591,40.6896057,23.6134033C383.5926208,378.5069885,360.9328918,391.6571045,342.9030151,381.1938477z M446.8650513,410.1780701c19.0138245,84.5610657-20.2017212,115.1062317-89.8516235,52.6367188c-71.8040466,63.1875916-109.589447,31.4198914-90.5613708-52.2318115c-83.1644897-25.5946045-88.9903717-78.3276978-0.6937866-104.946167c-19.1477814-90.8321228,28.0881958-110.7885284,91.2757263-51.5502014c67.1367798-62.1104736,108.8396301-33.8638611,90.8886108,51.9419861C529.420166,332.35672,537.5775146,379.4219971,446.8650513,410.1780701z M368.3667908,265.7214355c9.8764648,10.0271912,16.8166504,18.9304199,24.1953125,29.7196045c14.0048523,1.2748108,25.2732239,3.1539917,39.5039368,6.3639526C446.5467529,235.4802399,421.0112,214.3687897,368.3667908,265.7214355z M287.0745544,399.1678772c9.8329163,1.7405396,12.8335876,2.2414246,21.4079285,3.1184082c-5.2655945-8.7361755-8.4169312-12.0848999-13.7424011-23.4538574C291.1927185,387.7239685,290.2252808,390.3483582,287.0745544,399.1678772z M308.4535217,313.8979492c-8.6236877,0.652771-12.3464355,1.7249146-22.4972839,3.8290405c2.9201355,8.4489441,4.1842041,11.6097412,8.1012573,21.0124207C299.8532104,327.7695312,302.0353699,323.9804077,308.4535217,313.8979492z M329.7417908,404.1956177c19.1419678,1.1992798,35.8128967,1.4048157,54.1916809,0.0131226c11.0077515-17.1120911,19.5203247-31.2842712,26.2468262-45.1843872c-8.9886475-18.1747131-17.2431641-33.0267944-27.2641602-46.9899292c-17.8673706-1.3165894-33.8613892-1.3956604-52.1308289-0.3450623c-10.2962646,14.9137878-18.4819946,29.7328186-27.2613831,47.3153687C311.9961853,375.5177612,320.0400085,389.3323059,329.7417908,404.1956177z M405.3152466,401.8963623c8.980957-0.9541016,11.7819214-1.4473877,20.996521-3.3876953c-2.9855347-8.7675476-3.9324036-11.4634705-7.4186707-19.9230652C413.2800293,389.1059875,411.4625244,392.3719788,405.3152466,401.8963623z M419.3652954,338.7740173c3.8960571-8.6454773,4.9857178-11.6429749,8.0357971-20.706665c-9.1172485-2.0127869-12.2489929-2.6235962-22.0381775-3.9636841C411.7904358,324.1884155,413.808197,327.8135986,419.3652954,338.7740173z M356.7188721,277.896698c-6.181366,7.2260132-7.8807678,9.2361755-12.9373474,15.8865051c11.550354-0.4245911,14.9698792-0.4452209,26.1514587-0.0065613C364.4315186,286.4547729,362.7428894,284.3991394,356.7188721,277.896698z M281.2912903,301.4412537c14.2307739-3.2099609,25.8338318-5.0844727,39.8386841-6.3592834c7.3786926-10.7891846,14.3179321-19.334259,24.194397-29.3614807C290.5912476,215.5077515,267.0067139,233.9416962,281.2912903,301.4412537z M284.5592651,358.3230896c-5.9060669-12.7605591-10.2599487-23.7089539-14.5718079-36.7932739c-70.4876099,20.7035217-66.3744354,52.9957886,0.6984863,73.5182495C274.5863037,382.6658936,278.8204041,371.5198059,284.5592651,358.3230896z M345.3346558,451.2239075c-9.3200073-9.5963745-16.4405212-18.8392029-24.9134216-30.7967529c-14.0818176-1.4981384-25.0709839-2.5043945-37.7563782-5.6159058C264.0772095,487.0343323,297.5268555,498.1216125,345.3346558,451.2239075z M371.5346985,421.6913147c-11.7788086,0.3000793-16.6086426,0.2579651-29.4278259-0.0121155c5.7509155,8.2714844,8.0646057,11.1280823,14.5596313,17.8538208C363.4008179,432.5393372,365.8301697,429.7841492,371.5346985,421.6913147z M430.99823,414.4344177c-13.5774536,3.0973206-24.5089417,4.688324-37.7385864,5.6617432c-7.7511292,11.1494141-14.9326782,20.2267761-24.933075,31.0922546C419.8050842,500.2810669,447.6533203,482.0038757,430.99823,414.4344177z M443.3474121,321.9057312c-4.2514343,13.0842896-8.3977356,23.6558838-14.2211609,36.4164124c5.6585693,13.1967163,9.677887,23.6125488,13.5236206,35.9946899C517.6851196,371.2198486,503.546814,339.8165894,443.3474121,321.9057312z"/></svg>',
    title: "Восемьдесят процентов практики",
    desc:
      "Подобное обучение обычно дает точечные практические навыки, которые будут применимы для реальной жизни",
  },
];

const listItemsPrice = [
  {
    id: 1,
    title: "Курс Начинающий",
    list: ["HTML", "CSS"],
    skills: [
      "Знаниям и умениям применять на практике HTML",
      "Использовать самые последние новшества CSS",
      "Верстать статические сайты",
      "Изучите свойства и возможности применения HTML/CSS",
    ],
    price: 5000,
    sale: 3555,
  },
  {
    id: 2,
    title: "Курс Продвинутый",
    list: [
      "Курс Начинающий в подарок",
      "HTML5",
      "CSS3",
      "JavaScript базовый",
      "Препроцессоры SASS/SCSS, LESS",
      "Git",
    ],
    skills: [
      "Изучите свойства и возможности применения HTML/CSS",
      "Знаниям и умениям применять на практике HTML5",
      "Использовать самые последние новшества CSS3",
      "Препроцессоры SASS, SCSS, LESS",
      "Верстать статические сайты",
      "Использовать тени, скругленные углы блоков без использования изображений",
      "Создавать текстовые эффекты",
      "Использовать на своих сайтах нестандартные загружаемые шрифты",
      "Определять поддерживаются ли возможности HTML5/CSS3 в браузере пользователя",
      "Использовать встроенные возможности браузера для воспроизведения аудио и видео на веб-страницах",
      "Разбираться в языке JavaScript и писать код, соответствующий стандартам",
      "Использовать инструменты разработки и отладку в браузере",
      "Управлять структурой страницы DOM",
      "Создавать и реагировать на различные события в браузере",
    ],
    price: 15000,
    sale: 10555,
  },
  {
    id: 3,
    title: "Курс Frontend-разработчик",
    list: [
      "Курс Начинающий в подарок",
      "Курс Продвинутый в подарок",
      "JavaScript продвинутый",
      "VueJS",
      "ReactJS",
      "Webpack",
    ],
    skills: [
      "Изучите свойства и возможности применения HTML/CSS",
      "Знаниям и умениям применять на практике HTML5",
      "Использовать самые последние новшества CSS3",
      "Препроцессоры SASS, SCSS, LESS",
      "Верстать статические сайты",
      "Использовать тени, скругленные углы блоков без использования изображений",
      "Создавать текстовые эффекты",
      "Использовать на своих сайтах нестандартные загружаемые шрифты",
      "Определять поддерживаются ли возможности HTML5/CSS3 в браузере пользователя",
      "Использовать встроенные возможности браузера для воспроизведения аудио и видео на веб-страницах",
      "Разбираться в языке JavaScript и писать код, соответствующий стандартам",
      "Использовать инструменты разработки и отладку в браузере",
      "Управлять структурой страницы DOM",
      "Создавать и реагировать на различные события в браузере",
      "Использовать возможности ReactJS",
      "Верстать динамические сайты",
      "Использовать возможности Git для командной работы",
      "Использовать возможности Webpack для сборки проекта",
      "Использовать возможности шаблонизатора Tailwindcss",
    ],
    price: 25000,
    sale: 20555,
  },
];

var i = 0;

function listAdv(i) {
  // console.log(n.innerHTML);
  listi.forEach((item) => {
    item.children[0].innerHTML = listItems[i].svgIcon;
    item.children[1].innerHTML = listItems[i].title;
    item.children[2].innerHTML = listItems[i].desc;
    i++;
  });
}

listAdv(0);

let listCard = document.querySelectorAll(".card");

function listPrice(j, n) {
  for (let i = 0; i < listCard.length; i++) {
    // listCard[i].children[j].innerHTML = listItemsPrice[i].title;
    var listLi = listCard[i].children[j + 1];
    if (n === "list") {
      listItemsPrice[i].list.map((item) => {
        let list = document.createElement("li");
        list.classList.add("item");
        list.innerHTML = item;
        listLi.appendChild(list);
      });
    }
    if (n === "skills") {
      listItemsPrice[i].skills.map((item) => {
        let list = document.createElement("li");
        list.classList.add("item");
        list.innerHTML = item;
        listLi.appendChild(list);
      });
    }
  }
}

let price = document.querySelectorAll("div.price");

console.log(price);
function Price(price) {
  let i = 0;
  listItemsPrice.map((item, i) => {
    price[i].children[0].innerHTML = item.price;
    price[i].children[1].innerHTML = item.sale;
    i++;
  });
}

listPrice(1, "list");
listPrice(3, "skills");
Price(price);


Side();

function Side(params) {
  const bodyPage = document.querySelector('body');
  var card = document.querySelectorAll(".listCards .card");
  var ShowHide = document.querySelector("#hide");
  var hide = document.querySelector(".button.hide");

  console.log(ShowHide);
  card.forEach((item) => {
    item.addEventListener("click", toggleShowHide, false);
    let cardFixed = item.cloneNode(true);
    function toggleShowHide() {
      console.log(cardFixed);
      if (!ShowHide.classList.contains("show")) {
        bodyPage.style.overflow = "hidden";
        ShowHide.classList.toggle("show");
        ShowHide.appendChild(cardFixed);
      }
      //console.log(item);
    }
    hide.addEventListener("click", handleHide, false);
    function handleHide() {
      if (ShowHide.classList.contains("show")) {
        bodyPage.style.overflow = "auto";
        ShowHide.classList.remove("show");
        ShowHide.querySelector(".card").remove();
        // ShowHide.children[1].remove();
      }
    }
  });
}

/**Подсчет ширины браузера в реальном времени */
// const width = document.querySelector(".width");

// window.addEventListener(
//   "resize",
//   function () {
//     width.innerHTML = innerWidth;
//   },
//   false
// );
/**------------------------------------------ */

// console.log(listLi)
// listItems.map((item) => {
//   list(title, item.title);
//   list(imgSVG, item.imgSVG);
//   list(desc, item.desc);
// });
